<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;9&#31456; &#20998;&#26512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;</title><meta name="generator" content="DocBook XSL Stylesheets V1.71.1"><link rel="start" href="index.html" title="FindBugs&#8482; &#12510;&#12491;&#12517;&#12450;&#12523;"><link rel="up" href="index.html" title="FindBugs&#8482; &#12510;&#12491;&#12517;&#12450;&#12523;"><link rel="prev" href="filter.html" title="&#31532;8&#31456; &#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;"><link rel="next" href="annotations.html" title="&#31532;10&#31456; &#12450;&#12494;&#12486;&#12540;&#12471;&#12519;&#12531;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;9&#31456; &#20998;&#26512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="filter.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="annotations.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="analysisprops"></a>&#31532;9&#31456; &#20998;&#26512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;</h2></div></div></div><p><span class="application">FindBugs</span> &#12399;&#20998;&#26512;&#12377;&#12427;&#22580;&#21512;&#12395;&#12356;&#12367;&#12388;&#12363;&#12398;&#35251;&#28857;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#12289;&#35251;&#28857;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12375;&#12390;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12471;&#12473;&#12486;&#12512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;&#12434;&#20351;&#12387;&#12390;&#12289;&#12381;&#12428;&#12425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#31456;&#12391;&#12399;&#12289;&#20998;&#26512;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#35373;&#23450;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;</p><p>&#20998;&#26512;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#20027;&#12394;&#30446;&#30340;&#12399;&#12289; 2 &#12388;&#12354;&#12426;&#12414;&#12377;&#12290;1 &#30058;&#30446;&#12399;&#12289; <span class="application">FindBugs</span> &#12395;&#23550;&#12375;&#12390;&#20998;&#26512;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#24847;&#21619;&#12434;&#20253;&#12360;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391; <span class="application">FindBugs</span> &#12364;&#12424;&#12426;&#27491;&#30906;&#12394;&#32080;&#26524;&#12434;&#20986;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;&#35492;&#26908;&#20986;&#12434;&#28187;&#12425;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;2 &#30058;&#30446;&#12395;&#12289;&#20998;&#26512;&#12434;&#34892;&#12358;&#12395;&#24403;&#12383;&#12426;&#12381;&#12398;&#31934;&#24230;&#12434;&#35373;&#23450;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#20998;&#26512;&#12398;&#31934;&#24230;&#12434;&#33853;&#12392;&#12377;&#12371;&#12392;&#12391;&#12289;&#12513;&#12514;&#12522;&#20351;&#29992;&#37327;&#12392;&#20998;&#26512;&#26178;&#38291;&#12434;&#28187;&#12425;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#26412;&#24403;&#12398;&#12496;&#12464;&#12434;&#35211;&#36867;&#12375;&#12383;&#12426;&#12289;&#35492;&#26908;&#20986;&#12398;&#25968;&#12364;&#22679;&#12360;&#12427;&#12392;&#12356;&#12358;&#20195;&#20767;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p><p>&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12458;&#12503;&#12471;&#12519;&#12531; <span><strong class="command">-property</strong></span> &#12434;&#20351;&#12387;&#12390;&#12289;&#20998;&#26512;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;:</p><pre class="screen">
<code class="prompt">$ </code><span><strong class="command">findbugs -textui -property "cfg.noprune=true" <em class="replaceable"><code>myApp.jar</code></em></strong></span>
</pre><p>
</p><p>&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#20998;&#26512;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#19968;&#35239;&#12434; <a href="analysisprops.html#analysisproptable" title="&#34920; 9.1. &#35373;&#23450;&#21487;&#33021;&#12394;&#20998;&#26512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;">&#34920;&nbsp;9.1. &#12300;&#35373;&#23450;&#21487;&#33021;&#12394;&#20998;&#26512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;&#12301;</a> &#12395;&#31034;&#12375;&#12414;&#12377;&#12290;</p><div class="table"><a name="analysisproptable"></a><p class="title"><b>&#34920; 9.1. &#35373;&#23450;&#21487;&#33021;&#12394;&#20998;&#26512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;</b></p><div class="table-contents"><table summary="&#35373;&#23450;&#21487;&#33021;&#12394;&#20998;&#26512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;" border="1"><colgroup><col><col><col></colgroup><thead><tr><th align="left">&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;&#21517;</th><th align="left">&#35373;&#23450;&#20516;</th><th align="left">&#30446;&#30340;</th></tr></thead><tbody><tr><td align="left">findbugs.assertionmethods</td><td align="left">&#12467;&#12531;&#12510;&#21306;&#20999;&#12426;&#12398;&#23436;&#20840;&#20462;&#39166;&#12513;&#12477;&#12483;&#12489;&#21517;&#12522;&#12473;&#12488; : &#20363;&#12289; "com.foo.MyClass.checkAssertion"</td><td align="left">&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;&#12395;&#12399;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#27491;&#12375;&#12356;&#12371;&#12392;&#12434;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12431;&#12428;&#12427;&#12513;&#12477;&#12483;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289; &#12481;&#12455;&#12483;&#12463;&#12513;&#12477;&#12483;&#12489;&#12391;&#30906;&#35469;&#12375;&#12383;&#20516;&#12395;&#23550;&#12377;&#12427; null &#21442;&#29031;&#12450;&#12463;&#12475;&#12473;&#12487;&#12451;&#12486;&#12463;&#12479;&#12398;&#35492;&#26908;&#20986;&#12434;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;</td></tr><tr><td align="left">findbugs.de.comment</td><td align="left">true &#12414;&#12383;&#12399; false</td><td align="left">true &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289; DroppedException (&#28961;&#35222;&#12373;&#12428;&#12383;&#20363;&#22806;) &#12487;&#12451;&#12486;&#12463;&#12479;&#12399;&#31354;&#12398; catch &#12502;&#12525;&#12483;&#12463; &#12395;&#12467;&#12513;&#12531;&#12488;&#12364;&#28961;&#12356;&#12363;&#25506;&#12375;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#12289;&#12467;&#12513;&#12531;&#12488;&#12364;&#12415;&#12388;&#12363;&#12387;&#12383;&#22580;&#21512;&#12395;&#12399;&#35686;&#21578;&#12364;&#22577;&#21578;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</td></tr><tr><td align="left">findbugs.maskedfields.locals</td><td align="left">true &#12414;&#12383;&#12399; false</td><td align="left">true &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#38560;&#34109;&#12375;&#12390;&#12356;&#12427;&#12525;&#12540;&#12459;&#12523;&#22793;&#25968;&#12395;&#23550;&#12375;&#12390;&#20778;&#20808;&#24230;(&#20302;)&#12398;&#35686;&#21578;&#12364;&#30330;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289; false &#12391;&#12377;&#12290;</td></tr><tr><td align="left">findbugs.nullderef.assumensp</td><td align="left">true &#12414;&#12383;&#12399; false</td><td align="left">&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290; (&#24847;&#22259; : true &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;null &#21442;&#29031;&#12450;&#12463;&#12475;&#12473;&#12487;&#12451;&#12486;&#12463;&#12479;&#12399;&#12513;&#12477;&#12483;&#12489;&#12363;&#12425;&#12398;&#25147;&#12426;&#20516;&#12289;&#12414;&#12383;&#12399;&#12289;&#12513;&#12477;&#12483;&#12489;&#12395;&#21463;&#12369;&#28193;&#12373;&#12428;&#12427;&#24341;&#25968;&#12434; null &#12391;&#12354;&#12427;&#12392;&#20206;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289; false &#12391;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#22823;&#37327;&#12398;&#35492;&#26908;&#20986;&#12364;&#29983;&#25104;&#12373;&#12428;&#12427;&#12391;&#12354;&#12429;&#12358;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;)</td></tr><tr><td align="left">findbugs.refcomp.reportAll</td><td align="left">true &#12414;&#12383;&#12399; false</td><td align="left">true &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;  == &#12362;&#12424;&#12403; != &#28436;&#31639;&#23376;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#30097;&#12431;&#12375;&#12356;&#21442;&#29031;&#27604;&#36611;&#12364;&#12377;&#12409;&#12390;&#22577;&#21578;&#12373;&#12428;&#12414;&#12377;&#12290; false &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#21516;&#27096;&#12398;&#35686;&#21578;&#12399; 1 &#12513;&#12477;&#12483;&#12489;&#12395;&#12388;&#12365; 1 &#12388;&#12375;&#12363;&#30330;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289; false &#12391;&#12377;&#12290;</td></tr><tr><td align="left">findbugs.sf.comment</td><td align="left">true &#12414;&#12383;&#12399; false</td><td align="left">true &#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289; SwitchFallthrough &#12487;&#12451;&#12486;&#12463;&#12479;&#12399;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#12300;fall&#12301;&#12414;&#12383;&#12399;&#12300;nobreak&#12301;&#12392;&#12356;&#12358;&#21336;&#35486;&#12434;&#21547;&#12435;&#12384;&#12467;&#12513;&#12531;&#12488;&#12434;&#35352;&#36617;&#12375;&#12390;&#12356;&#12394;&#12356; case&#12521;&#12505;&#12523; &#12395;&#38480;&#12426;&#35686;&#21578;&#12434;&#22577;&#21578;&#12375;&#12414;&#12377;&#12290;(&#12371;&#12398;&#27231;&#33021;&#12364;&#27491;&#12375;&#12367;&#21205;&#20316;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#27491;&#30906;&#12394;&#12477;&#12540;&#12473;&#12497;&#12473;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;) &#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#24847;&#22259;&#30340;&#12391;&#12399;&#12394;&#12356; switch &#25991;&#12398; fallthrough &#12434;&#30330;&#35211;&#12375;&#26131;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;</td></tr></tbody></table></div></div><br class="table-break"></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="filter.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="annotations.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;8&#31456; &#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;10&#31456; &#12450;&#12494;&#12486;&#12540;&#12471;&#12519;&#12531;</td></tr></table></div></body></html>