<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;8&#31456; &#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;</title><meta name="generator" content="DocBook XSL Stylesheets V1.71.1"><link rel="start" href="index.html" title="FindBugs&#8482; &#12510;&#12491;&#12517;&#12450;&#12523;"><link rel="up" href="index.html" title="FindBugs&#8482; &#12510;&#12491;&#12517;&#12450;&#12523;"><link rel="prev" href="eclipse.html" title="&#31532;7&#31456; FindBugs&#8482; Eclipse &#12503;&#12521;&#12464;&#12452;&#12531;&#12398;&#20351;&#29992;&#26041;&#27861;"><link rel="next" href="analysisprops.html" title="&#31532;9&#31456; &#20998;&#26512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;8&#31456; &#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="eclipse.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="analysisprops.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="filter"></a>&#31532;8&#31456; &#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="filter.html#d0e1709">1. &#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;&#12398;&#27010;&#35201;</a></span></dt><dt><span class="sect1"><a href="filter.html#d0e1759">2. &#12510;&#12483;&#12481;&#12531;&#12464;&#26465;&#20214;&#12398;&#31278;&#39006;</a></span></dt><dt><span class="sect1"><a href="filter.html#d0e1958">3. Java &#35201;&#32032;&#21517;&#12510;&#12483;&#12481;&#12531;&#12464;</a></span></dt><dt><span class="sect1"><a href="filter.html#d0e1982">4. &#30041;&#24847;&#20107;&#38917;</a></span></dt><dt><span class="sect1"><a href="filter.html#d0e2012">5. &#20363;</a></span></dt><dt><span class="sect1"><a href="filter.html#d0e2065">6. &#23436;&#20840;&#12394;&#20363;</a></span></dt></dl></div><p>&#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#29305;&#23450;&#12398;&#12463;&#12521;&#12473;&#12420;&#12513;&#12477;&#12483;&#12489;&#12434;&#12496;&#12464;&#22577;&#21578;&#12395;&#21547;&#12417;&#12383;&#12426;&#12496;&#12464;&#22577;&#21578;&#12363;&#12425;&#38500;&#22806;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#31456;&#12391;&#12399;&#12289;&#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;&#12398;&#20351;&#29992;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><table border="0" summary="Note: &#35336;&#30011;&#12373;&#12428;&#12390;&#12356;&#12427;&#27231;&#33021;"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[&#27880;&#24847;]" src="note.png"></td><th align="left">&#35336;&#30011;&#12373;&#12428;&#12390;&#12356;&#12427;&#27231;&#33021;</th></tr><tr><td align="left" valign="top"><p>&#12501;&#12451;&#12523;&#12479;&#12540;&#12399;&#29694;&#22312;&#12289;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12391;&#12398;&#12415;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#26368;&#32066;&#30340;&#12395;&#12399;&#12289;&#12501;&#12451;&#12523;&#12479;&#12540;&#12398;&#12469;&#12509;&#12540;&#12488;&#12399; GUI &#12395;&#12418;&#36861;&#21152;&#12373;&#12428;&#12427;&#20104;&#23450;&#12391;&#12377;&#12290;</p></td></tr></table></div><p>
</p><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1709"></a>1. &#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;&#12398;&#27010;&#35201;</h2></div></div></div><p>&#27010;&#24565;&#30340;&#12395;&#35328;&#12360;&#12400;&#12289;&#12501;&#12451;&#12523;&#12479;&#12540;&#12399;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12434;&#12354;&#12427;&#22522;&#28310;&#12392;&#29031;&#21512;&#12375;&#12414;&#12377;&#12290;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289; &#29305;&#21029;&#12394;&#21462;&#12426;&#25201;&#12356;&#12434;&#12377;&#12427;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12434;&#36984;&#25246;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12354;&#12427;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12434;&#12496;&#12464;&#22577;&#21578;&#12395;&#21547;&#12417;&#12383;&#12426;&#12289;&#12496;&#12464;&#22577;&#21578;&#12363;&#12425;&#38500;&#22806;&#12375;&#12383;&#12426;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p><p>&#12501;&#12451;&#12523;&#12479;&#12540;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289; <a href="http://www.w3.org/XML/" target="_top">XML</a> &#25991;&#26360;&#12391;&#12377;&#12290;&#26368;&#19978;&#20301;&#35201;&#32032;&#12364;&#12288;<code class="literal">FindBugsFilter</code> &#35201;&#32032; &#12391;&#12354;&#12426;&#12289;&#12381;&#12398;&#23376;&#35201;&#32032;&#12392;&#12375;&#12390; <code class="literal">Match</code> &#35201;&#32032;&#12434;&#35079;&#25968;&#20491;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#12381;&#12428;&#12382;&#12428;&#12398; <code class="literal">Match</code> &#35201;&#32032;&#12399;&#12289;&#29983;&#25104;&#12373;&#12428;&#12383;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#36848;&#37096;&#12395;&#12354;&#12383;&#12426;&#12414;&#12377;&#12290;&#36890;&#24120;&#12289;&#12501;&#12451;&#12523;&#12479;&#12540;&#12399;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12434;&#38500;&#22806;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;:</p><pre class="screen">
<code class="prompt">$ </code><span><strong class="command">findbugs -textui -exclude <em class="replaceable"><code>myExcludeFilter.xml</code></em> <em class="replaceable"><code>myApp.jar</code></em></strong></span>
</pre><p>&#12414;&#12383;&#19968;&#26041;&#12391;&#12289;&#30340;&#12434;&#12375;&#12412;&#12387;&#12383;&#22577;&#21578;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;&#12496;&#12464;&#22577;&#21578;&#32080;&#26524;&#12434;&#36984;&#25246;&#12377;&#12427;&#12383;&#12417;&#12395;&#12501;&#12451;&#12523;&#12479;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12418;&#32771;&#12360;&#12425;&#12428;&#12414;&#12377; :</p><pre class="screen">
<code class="prompt">$ </code><span><strong class="command">findbugs -textui -include <em class="replaceable"><code>myIncludeFilter.xml</code></em> <em class="replaceable"><code>myApp.jar</code></em></strong></span>
</pre><p>
</p><p>
<code class="literal">Match</code> &#35201;&#32032;&#12399;&#23376;&#35201;&#32032;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#12381;&#12428;&#12425;&#12398;&#23376;&#35201;&#32032;&#12399;&#35542;&#29702;&#31309;&#12391;&#36848;&#37096;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#36848;&#37096;&#12364;&#30495;&#12391;&#12354;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#35201;&#32032;&#12364;&#30495;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1759"></a>2. &#12510;&#12483;&#12481;&#12531;&#12464;&#26465;&#20214;&#12398;&#31278;&#39006;</h2></div></div></div><div class="variablelist"><dl><dt><span class="term"><code class="literal">&lt;Bug&gt;</code></span></dt><dd><p>&#12371;&#12398;&#35201;&#32032;&#12399;&#12289;&#12496;&#12464;&#12497;&#12479;&#12540;&#12531;&#12434;&#25351;&#23450;&#12375;&#12390;&#29031;&#21512;&#12375;&#12414;&#12377;&#12290;<code class="literal">pattern</code> &#23646;&#24615;&#12395;&#12399;&#12289;&#12467;&#12531;&#12510;&#21306;&#20999;&#12426;&#12391;&#12496;&#12464;&#12497;&#12479;&#12540;&#12531;&#39006;&#22411;&#12398;&#12522;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12393;&#12398;&#35686;&#21578;&#12364;&#12393;&#12398;&#12496;&#12464;&#12497;&#12479;&#12540;&#12531;&#39006;&#22411;&#12395;&#12354;&#12383;&#12427;&#12363;&#12399;&#12289; <span><strong class="command">-xml</strong></span> &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12388;&#12363;&#12387;&#12390;&#20986;&#21147;&#12373;&#12428;&#12383;&#12418;&#12398; (<code class="literal">BugInstance</code> &#35201;&#32032;&#12398; <code class="literal">type</code> &#23646;&#24615;) &#12434;&#35211;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12289; <a href="../../bugDescriptions.html" target="_top">&#12496;&#12464;&#35299;&#35500;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p><p>&#12418;&#12387;&#12392;&#31890;&#24230;&#12398;&#31895;&#12356;&#29031;&#21512;&#12434;&#34892;&#12356;&#12383;&#12356;&#12392;&#12365;&#12399;&#12289; <code class="literal">code</code> &#23646;&#24615;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12496;&#12464;&#30053;&#31216;&#12398;&#12467;&#12531;&#12510;&#21306;&#20999;&#12426;&#12398;&#12522;&#12473;&#12488;&#12391;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12373;&#12425;&#12395;&#31890;&#24230;&#12398;&#31895;&#12356;&#29031;&#21512;&#12434;&#34892;&#12356;&#12383;&#12356;&#12392;&#12365;&#12399;&#12289; <code class="literal">category</code> &#23646;&#24615;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#27425;&#12395;&#31034;&#12377;&#12289;&#12496;&#12464;&#12459;&#12486;&#12468;&#12522;&#12540;&#21517;&#12398;&#12467;&#12531;&#12510;&#21306;&#20999;&#12426;&#12398;&#12522;&#12473;&#12488;&#12391;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377; : <code class="literal">CORRECTNESS</code>, <code class="literal">MT_CORRECTNESS</code>, <code class="literal">BAD_PRACTICICE</code>, <code class="literal">PERFORMANCE</code>, <code class="literal">STYLE</code>.</p><p>&#21516;&#12376; <code class="literal">&lt;Bug&gt;</code> &#35201;&#32032;&#12395;&#19978;&#35352;&#12398;&#23646;&#24615;&#12434;&#35079;&#25968;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12496;&#12464;&#12497;&#12479;&#12540;&#12531;&#21517;&#12289;&#12496;&#12464;&#30053;&#31216;&#12289;&#12496;&#12464;&#12459;&#12486;&#12468;&#12522;&#12540;&#12398;&#12356;&#12378;&#12428;&#12363;1&#12388;&#12391;&#12418;&#35442;&#24403;&#12377;&#12428;&#12400;&#12289;&#12496;&#12464;&#12497;&#12479;&#12540;&#12531;&#12399;&#21512;&#33268;&#12377;&#12427;&#12392;&#21028;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p><p>&#19979;&#20301;&#20114;&#25563;&#24615;&#12434;&#25345;&#12383;&#12379;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289; <code class="literal">&lt;Bug&gt;</code> &#35201;&#32032;&#12398;&#20195;&#12431;&#12426;&#12395; <code class="literal">&lt;BugPattern&gt;</code> &#35201;&#32032;&#12362;&#12424;&#12403; <code class="literal">&lt;BugCode&gt;</code> &#35201;&#32032;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12428;&#12425;&#12398;&#35201;&#32032;&#12399;&#12381;&#12428;&#12382;&#12428;&#12289; <code class="literal">name</code> &#23646;&#24615;&#12391;&#20516;&#12398;&#12522;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#35201;&#32032;&#12399;&#12289;&#23558;&#26469;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12394;&#12367;&#12394;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><code class="literal">&lt;Priority&gt;</code></span></dt><dd><p>&#12371;&#12398;&#35201;&#32032;&#12399;&#12289;&#29305;&#23450;&#12398;&#20778;&#20808;&#24230;&#12434;&#12418;&#12388;&#35686;&#21578;&#12434;&#29031;&#21512;&#12375;&#12414;&#12377;&#12290;<code class="literal">value</code> &#23646;&#24615;&#12395;&#12399;&#12289;&#25972;&#25968;&#20516;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377; : 1 &#12399;&#20778;&#20808;&#24230;(&#39640;)&#12289;&#12414;&#12383;&#12289; 2  &#12399;&#20778;&#20808;&#24230;(&#20013;) &#12289; 3 &#12399;&#20778;&#20808;&#24230;(&#20302;) &#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><code class="literal">&lt;Package&gt;</code></span></dt><dd><p>&#12371;&#12398;&#35201;&#32032;&#12399;&#12289; <code class="literal">name</code> &#23646;&#24615;&#12391;&#25351;&#23450;&#12375;&#12383;&#29305;&#23450;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#20869;&#12395;&#12354;&#12427;&#12463;&#12521;&#12473;&#12395;&#38306;&#36899;&#12375;&#12383;&#35686;&#21578;&#12434;&#29031;&#21512;&#12375;&#12414;&#12377;&#12290;&#20837;&#12428;&#23376;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#21547;&#12414;&#12428;&#12414;&#12379;&#12435; (Java import &#25991;&#12395;&#24467;&#12387;&#12390;&#12356;&#12414;&#12377;) &#12290;&#12375;&#12363;&#12375;&#12394;&#12364;&#12425;&#12289;&#27491;&#35215;&#34920;&#29694;&#12434;&#20351;&#12358;&#12392;&#35079;&#25968;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#12510;&#12483;&#12481;&#12373;&#12379;&#12427;&#12371;&#12392;&#12399;&#31777;&#21336;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><code class="literal">&lt;Class&gt;</code></span></dt><dd><p>&#12371;&#12398;&#35201;&#32032;&#12399;&#12289;&#29305;&#23450;&#12398;&#12463;&#12521;&#12473;&#12395;&#38306;&#36899;&#12375;&#12383;&#35686;&#21578;&#12434;&#29031;&#21512;&#12375;&#12414;&#12377;&#12290;<code class="literal">name</code> &#23646;&#24615;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#29031;&#21512;&#12377;&#12427;&#12463;&#12521;&#12473;&#21517;&#12434;&#12463;&#12521;&#12473;&#21517;&#12381;&#12398;&#12418;&#12398;&#12363;&#12289;&#12414;&#12383;&#12399;&#12289;&#27491;&#35215;&#34920;&#29694;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p><p>&#19979;&#20301;&#20114;&#25563;&#24615;&#12434;&#25345;&#12383;&#12379;&#12383;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#35201;&#32032;&#12398;&#20195;&#12431;&#12426;&#12395; <code class="literal">Match</code> &#35201;&#32032;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12463;&#12521;&#12473;&#21517;&#12381;&#12398;&#12418;&#12398;&#12398;&#25351;&#23450;&#12399; <code class="literal">class</code> &#23646;&#24615;&#12434;&#12289;&#12463;&#12521;&#12473;&#21517;&#12434;&#27491;&#35215;&#34920;&#29694;&#12391;&#25351;&#23450;&#12377;&#12427;&#22580;&#21512;&#12399; <code class="literal">classregex</code> &#23646;&#24615;&#12434;&#12381;&#12428;&#12382;&#12428;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;</p><p>&#12418;&#12375; <code class="literal">Match</code> &#35201;&#32032;&#12395; <code class="literal">Class</code> &#35201;&#32032;&#12364;&#28961;&#12363;&#12387;&#12383;&#12426;&#12289; <code class="literal">class</code> / <code class="literal">classregex</code> &#23646;&#24615;&#12364;&#28961;&#12363;&#12387;&#12383;&#12426;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#22580;&#21512;&#12289;&#24819;&#23450;&#22806;&#12395;&#22810;&#12367;&#12398;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12364;&#19968;&#33268;&#12375;&#12390;&#12375;&#12414;&#12358;&#12371;&#12392;&#12364;&#12354;&#12426;&#24471;&#12414;&#12377;&#12290;&#12381;&#12398;&#22580;&#21512;&#12399;&#12289;&#36969;&#24403;&#12394;&#12513;&#12477;&#12483;&#12489;&#12420;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#32094;&#12426;&#36796;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p></dd><dt><span class="term"><code class="literal">&lt;Method&gt;</code></span></dt><dd><p>&#12371;&#12398;&#35201;&#32032;&#12399;&#12289;&#12513;&#12477;&#12483;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code class="literal">name</code> &#23646;&#24615;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#29031;&#21512;&#12377;&#12427;&#12513;&#12477;&#12483;&#12489;&#21517;&#12434;&#12513;&#12477;&#12483;&#12489;&#21517;&#12381;&#12398;&#12418;&#12398;&#12363;&#12289;&#12414;&#12383;&#12399;&#12289;&#27491;&#35215;&#34920;&#29694;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code class="literal">params</code> &#23646;&#24615;&#12395;&#12399;&#12289;&#12467;&#12531;&#12510;&#21306;&#20999;&#12426;&#12391;&#12513;&#12477;&#12483;&#12489;&#24341;&#25968;&#12398;&#22411;&#12398;&#12522;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code class="literal">returns</code> &#23646;&#24615;&#12395;&#12399;&#12513;&#12477;&#12483;&#12489;&#12398;&#25147;&#12426;&#20516;&#12398;&#22411;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code class="literal">params</code> &#12362;&#12424;&#12403; <code class="literal">returns</code> &#12395;&#12362;&#12356;&#12390;&#12399;&#12289;&#12463;&#12521;&#12473;&#21517;&#12399;&#23436;&#20840;&#20462;&#39166;&#21517;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;(&#20363;&#12360;&#12400;&#12289;&#21336;&#12395; "String" &#12391;&#12399;&#12394;&#12367; "java.lang.String" &#12392;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;) <code class="literal">params</code> <code class="literal">returns</code> &#12398;&#12393;&#12385;&#12425;&#12363;&#19968;&#26041;&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12418;&#12358;&#19968;&#26041;&#12398;&#23646;&#24615;&#12398;&#25351;&#23450;&#12418;&#24517;&#38920;&#12391;&#12377;&#12290;&#12394;&#12380;&#12394;&#12425;&#12400;&#12289;&#12513;&#12477;&#12483;&#12489;&#12471;&#12464;&#12491;&#12481;&#12515;&#12540;&#12434;&#27083;&#31689;&#12398;&#12383;&#12417;&#12395;&#24517;&#35201;&#12384;&#12363;&#12425;&#12391;&#12377;&#12290;<code class="literal">name</code> &#23646;&#24615;&#12289;<code class="literal">params</code> &#23646;&#24615; &#12362;&#12424;&#12403; <code class="literal">returns</code> &#23646;&#24615;&#12414;&#12383;&#12399; 3 &#12388;&#12398; &#23646;&#24615;&#12377;&#12409;&#12390;&#12289;&#12398;&#12393;&#12428;&#12363;&#12434;&#26465;&#20214;&#12392;&#12377;&#12427;&#12371;&#12392;&#12391;&#12365;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12395;&#12289;&#21517;&#21069;&#12392;&#12471;&#12464;&#12491;&#12481;&#12515;&#12540;&#12395;&#22522;&#12389;&#12367;&#27096;&#12293;&#12394;&#31278;&#39006;&#12398;&#26465;&#20214;&#12434;&#35215;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><code class="literal">&lt;Field&gt;</code></span></dt><dd><p>&#12371;&#12398;&#35201;&#32032;&#12399;&#12289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code class="literal">name</code> &#23646;&#24615;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#29031;&#21512;&#12377;&#12427;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12434;&#12501;&#12451;&#12540;&#12523;&#12489;&#21517;&#12381;&#12398;&#12418;&#12398;&#12363;&#12289;&#12414;&#12383;&#12399;&#12289;&#27491;&#35215;&#34920;&#29694;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#12471;&#12464;&#12491;&#12481;&#12515;&#12540;&#12395;&#29031;&#12425;&#12375;&#12383;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12434;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; <code class="literal">type</code> &#23646;&#24615;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#22411;&#12434;&#23436;&#20840;&#20462;&#39166;&#21517;&#12391;&#25351;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#21517;&#21069;&#12392;&#12471;&#12464;&#12491;&#12481;&#12515;&#12540;&#12395;&#22522;&#12389;&#12367;&#26465;&#20214;&#12434;&#35215;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12381;&#12398;2&#12388;&#12398;&#23646;&#24615;&#12434;&#20001;&#26041;&#12392;&#12418;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p></dd><dt><span class="term"><code class="literal">&lt;Local&gt;</code></span></dt><dd><p>&#12371;&#12398;&#35201;&#32032;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#22793;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code class="literal">name</code> &#23646;&#24615;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#29031;&#21512;&#12377;&#12427;&#12525;&#12540;&#12459;&#12523;&#22793;&#25968;&#21517;&#12434;&#12525;&#12540;&#12459;&#12523;&#22793;&#25968;&#21517;&#12381;&#12398;&#12418;&#12398;&#12363;&#12289;&#12414;&#12383;&#12399;&#12289;&#27491;&#35215;&#34920;&#29694;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#22793;&#25968;&#12392;&#12399;&#12289;&#12513;&#12477;&#12483;&#12489;&#20869;&#12391;&#23450;&#32681;&#12375;&#12383;&#22793;&#25968;&#12391;&#12377;&#12290;</p></dd><dt><span class="term"><code class="literal">&lt;Or&gt;</code></span></dt><dd><p>&#12371;&#12398;&#35201;&#32032;&#12399;&#12289;&#35542;&#29702;&#21644;&#12392;&#12375;&#12390; <code class="literal">Match</code> &#26465;&#38917;&#12434;&#32080;&#21512;&#12375;&#12414;&#12377;&#12290;&#12377;&#12394;&#12431;&#12385;&#12289;2&#12388;&#12398; <code class="literal">Method</code> &#35201;&#32032;&#12434; <code class="literal">Or</code> &#26465;&#38917;&#12395;&#20837;&#12428;&#12427;&#12371;&#12392;&#12391;&#12289;&#12393;&#12385;&#12425;&#12363;&#19968;&#26041;&#12398;&#12513;&#12477;&#12483;&#12489;&#12391;&#12510;&#12483;&#12481;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p></dd></dl></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1958"></a>3. Java &#35201;&#32032;&#21517;&#12510;&#12483;&#12481;&#12531;&#12464;</h2></div></div></div><p><code class="literal">Class</code> &#12289; <code class="literal">Method</code> &#12414;&#12383;&#12399; <code class="literal">Field</code> &#12398; <code class="literal">name</code> &#23646;&#24615;&#12364;&#25991;&#23383; ~ &#12391;&#22987;&#12414;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#23646;&#24615;&#20516;&#12398;&#27531;&#12426;&#12398;&#37096;&#20998;&#12434; Java &#12398;&#27491;&#35215;&#34920;&#29694;&#12392;&#12375;&#12390;&#35299;&#37320;&#12375;&#12414;&#12377;&#12290;&#12381;&#12358;&#12375;&#12390;&#12289;&#24403;&#35442; Java &#35201;&#32032;&#12398;&#21517;&#21069;&#12395;&#23550;&#12375;&#12390;&#12398;&#29031;&#21512;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;</p><p>&#12497;&#12479;&#12540;&#12531;&#12398;&#29031;&#21512;&#12399;&#35201;&#32032;&#12398;&#21517;&#21069;&#20840;&#20307;&#12395;&#23550;&#12375;&#12390;&#34892;&#12431;&#12428;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;&#37096;&#20998;&#19968;&#33268;&#29031;&#21512;&#12434;&#34892;&#12356;&#12383;&#12356;&#22580;&#21512;&#12399;&#12497;&#12479;&#12540;&#12531;&#25991;&#23383;&#21015;&#12398;&#21069;&#24460;&#12395; .* &#12434;&#20184;&#21152;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p><p>&#12497;&#12479;&#12540;&#12531;&#12398;&#27083;&#25991;&#35215;&#21063;&#12395;&#38306;&#12375;&#12390;&#12399;&#12289; <a href="http://java.sun.com/j2se/1.5.0/ja/docs/ja/api/java/util/regex/Pattern.html" target="_top"><code class="literal">java.util.regex.Pattern</code></a> &#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1982"></a>4. &#30041;&#24847;&#20107;&#38917;</h2></div></div></div><p>
<code class="literal">Match</code> &#26465;&#38917;&#12399;&#12289;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12395;&#23455;&#38555;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#24773;&#22577;&#12395;&#12398;&#12415;&#19968;&#33268;&#12375;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12399;&#12463;&#12521;&#12473;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#19968;&#33324;&#30340;&#12395;&#35328;&#12387;&#12390;&#12289;&#12496;&#12464;&#12434;&#38500;&#22806;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12463;&#12521;&#12473;&#12434;&#29992;&#12356;&#12390;&#34892;&#12358;&#12392;&#12358;&#12414;&#12367;&#12356;&#12367;&#12371;&#12392;&#12364;&#22810;&#12356;&#12391;&#12377;&#12290;</p><p>&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12398;&#20013;&#12395;&#12399;&#12289;2&#20491;&#20197;&#19978;&#12398;&#12463;&#12521;&#12473;&#12434;&#20445;&#25345;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289; DE (dropped exception : &#20363;&#22806;&#12398;&#28961;&#35222;) &#12496;&#12464;&#12399;&#12289; &#20363;&#22806;&#12398;&#28961;&#35222;&#12364;&#30330;&#29983;&#12375;&#12383;&#12513;&#12477;&#12483;&#12489;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12463;&#12521;&#12473;&#12392;&#12289; &#28961;&#35222;&#12373;&#12428;&#12383;&#20363;&#22806;&#12398;&#22411;&#12434;&#34920;&#12377;&#12463;&#12521;&#12473;&#12398;&#20001;&#26041;&#12434;&#21547;&#12435;&#12384;&#24418;&#12391;&#22577;&#21578;&#12373;&#12428;&#12414;&#12377;&#12290;<code class="literal">Match</code> &#26465;&#38917;&#12392;&#12399;&#12289; <span class="emphasis"><em>1&#30058;&#30446;</em></span> (&#20027;) &#12398;&#12463;&#12521;&#12473;&#12398;&#12415;&#12364;&#29031;&#21512;&#12373;&#12428;&#12414;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#20363;&#12360;&#12400;&#12289;&#12463;&#12521;&#12473; "com.foobar.A" &#12289; "com.foobar.B" &#38291;&#12391;&#12398; IC (initialization circularity : &#21021;&#26399;&#21270;&#26178;&#12398;&#20966;&#29702;&#24490;&#29872;) &#12496;&#12464;&#22577;&#21578;&#12434;&#25233;&#27490;&#12375;&#12383;&#12356;&#22580;&#21512;&#12289;&#20197;&#19979;&#12395;&#31034;&#12377;&#12424;&#12358;&#12395; 2&#12388;&#12398; <code class="literal">Match</code> &#26465;&#38917;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377; :</p><pre class="programlisting">
   &lt;Match&gt;
      &lt;Class name="com.foobar.A" /&gt;
      &lt;Bug code="IC" /&gt;
   &lt;/Match&gt;

   &lt;Match&gt;
      &lt;Class name="com.foobar.B" /&gt;
      &lt;Bug code="IC" /&gt;
   &lt;/Match&gt;
</pre><p>&#26126;&#31034;&#30340;&#12395;&#20001;&#26041;&#12398;&#12463;&#12521;&#12473;&#12391;&#29031;&#21512;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#24490;&#29872;&#12375;&#12390;&#12356;&#12427;&#12393;&#12385;&#12425;&#12398;&#12463;&#12521;&#12473;&#12364;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12398; 1 &#30058;&#30446;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12363;&#12395;&#38306;&#20418;&#12394;&#12367;&#19968;&#33268;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;(&#12418;&#12385;&#12429;&#12435;&#12371;&#12398;&#26041;&#27861;&#12399;&#12289;&#20966;&#29702;&#24490;&#29872;&#12364; "com.foobar.A" &#12289; "com.foobar.B" &#12395;&#21152;&#12360;&#12390;3&#30058;&#30446;&#12398;&#12463;&#12521;&#12473;&#12418;&#21547;&#12435;&#12391;&#12356;&#12427;&#22580;&#21512;&#12399;&#22259;&#12425;&#12378;&#12418;&#22833;&#25943;&#12375;&#12390;&#12375;&#12414;&#12358;&#24656;&#12428;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;)</p><p>&#22810;&#12367;&#12398;&#31278;&#39006;&#12398;&#12496;&#12464;&#22577;&#21578;&#12399;&#12289;&#33258;&#36523;&#12364;&#20986;&#29694;&#12375;&#12383;&#12513;&#12477;&#12483;&#12489;&#12434;&#22577;&#21578;&#12375;&#12414;&#12377;&#12290;&#12381;&#12428;&#12425;&#12398;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289; <code class="literal">Method</code> &#26465;&#38917;&#12434; <code class="literal">Match</code> &#35201;&#32032;&#12395;&#21152;&#12360;&#12427;&#12392;&#26399;&#24453;&#36890;&#12426;&#12398;&#21205;&#20316;&#12434;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e2012"></a>5. &#20363;</h2></div></div></div><p>1. &#29305;&#23450;&#12398;&#12463;&#12521;&#12473;&#12395;&#23550;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12496;&#12464;&#22577;&#21578;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;</p><pre class="programlisting">

     &lt;Match&gt;
       &lt;Class name="com.foobar.MyClass" /&gt;
     &lt;/Match&gt;

</pre><p>

</p><p>2. &#12496;&#12464;&#30053;&#31216;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#29305;&#23450;&#12398;&#12463;&#12521;&#12473;&#12395;&#23550;&#12377;&#12427;&#29305;&#23450;&#12398;&#26908;&#26619;&#38917;&#30446;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;</p><pre class="programlisting">

     &lt;Match&gt;
       &lt;Class name="com.foobar.MyClass"/ &gt;
       &lt;Bug code="DE,UrF,SIC" /&gt;
     &lt;/Match&gt;

</pre><p>
</p><p>3. &#12496;&#12464;&#30053;&#31216;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12395;&#23550;&#12377;&#12427;&#29305;&#23450;&#12398;&#26908;&#26619;&#38917;&#30446;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;</p><pre class="programlisting">

     &lt;Match&gt;
       &lt;Bug code="DE,UrF,SIC" /&gt;
     &lt;/Match&gt;

</pre><p>
</p><p>4. &#12496;&#12464;&#12459;&#12486;&#12468;&#12522;&#12540;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12395;&#23550;&#12377;&#12427;&#29305;&#23450;&#12398;&#26908;&#26619;&#38917;&#30446;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;</p><pre class="programlisting">

     &lt;Match&gt;
       &lt;Bug category="PERFORMANCE" /&gt;
     &lt;/Match&gt;

</pre><p>
</p><p>5. &#12496;&#12464;&#30053;&#31216;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;&#29305;&#23450;&#12398;&#12463;&#12521;&#12473;&#12398;&#25351;&#23450;&#12373;&#12428;&#12383;&#12513;&#12477;&#12483;&#12489;&#12395;&#23550;&#12377;&#12427;&#29305;&#23450;&#12398;&#12496;&#12464;&#31278;&#21029;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;</p><pre class="programlisting">

     &lt;Match&gt;
       &lt;Class name="com.foobar.MyClass" /&gt;
       &lt;Or&gt;
         &lt;Method name="frob" params="int,java.lang.String" returns="void" /&gt;
         &lt;Method name="blat" params="" returns="boolean" /&gt;
       &lt;/Or&gt;
       &lt;Bug code="DC" /&gt;
     &lt;/Match&gt;

</pre><p>
</p><p>6. &#29305;&#23450;&#12398;&#12513;&#12477;&#12483;&#12489;&#12395;&#23550;&#12377;&#12427;&#29305;&#23450;&#12398;&#12496;&#12464;&#12497;&#12479;&#12540;&#12531;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;</p><pre class="programlisting">

    &lt;!-- open stream &#12395;&#38306;&#12377;&#12427;&#35492;&#26908;&#20986;&#12364;&#12354;&#12427;&#12513;&#12477;&#12483;&#12489;&#12290;--&gt;
    &lt;Match&gt;
      &lt;Class name="com.foobar.MyClass" /&gt;
      &lt;Method name="writeDataToFile" /&gt;
      &lt;Bug pattern="OS_OPEN_STREAM" /&gt;
    &lt;/Match&gt;

</pre><p>
</p><p>7. &#29305;&#23450;&#12398;&#12513;&#12477;&#12483;&#12489;&#12395;&#23550;&#12377;&#12427;&#29305;&#23450;&#12398;&#20778;&#20808;&#24230;&#12434;&#20184;&#19982;&#12373;&#12428;&#12383;&#29305;&#23450;&#12398;&#12496;&#12464;&#12497;&#12479;&#12540;&#12531;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;</p><pre class="programlisting">

    &lt;!-- dead local store (&#20778;&#20808;&#24230; (&#20013;)) &#12395;&#38306;&#12377;&#12427;&#35492;&#26908;&#20986;&#12364;&#12354;&#12427;&#12513;&#12477;&#12483;&#12489;&#12290;--&gt;
    &lt;Match&gt;
      &lt;Class name="com.foobar.MyClass" /&gt;
      &lt;Method name="someMethod" /&gt;
      &lt;Bug pattern="DLS_DEAD_LOCAL_STORE" /&gt;
      &lt;Priority value="2" /&gt;
    &lt;/Match&gt;

</pre><p>
</p><p>8. AspectJ &#12467;&#12531;&#12497;&#12452;&#12521;&#12540;&#12395;&#12424;&#12387;&#12390;&#24341;&#12365;&#36215;&#12371;&#12373;&#12428;&#12427;&#12510;&#12452;&#12490;&#12540;&#12496;&#12464;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377; (AspectJ &#12398;&#38283;&#30330;&#32773;&#12391;&#12418;&#12394;&#12356;&#38480;&#12426;&#12289;&#12381;&#12428;&#12425;&#12398;&#12496;&#12464;&#12395;&#38306;&#24515;&#12434;&#25345;&#12388;&#12371;&#12392;&#12399;&#12394;&#12356;&#12392;&#32771;&#12360;&#12414;&#12377;)&#12290;</p><pre class="programlisting">

    &lt;Match&gt; 
      &lt;Class name="~.*\$AjcClosure\d+" /&gt;
      &lt;Bug pattern="DLS_DEAD_LOCAL_STORE" /&gt;
      &lt;Method name="run" /&gt;
    &lt;/Match&gt;
    &lt;Match&gt;
      &lt;Bug pattern="UUF_UNUSED_FIELD" /&gt;
      &lt;Field name="~ajc\$.*" /&gt;
    &lt;/Match&gt;

</pre><p>
</p><p>9. &#22522;&#30436;&#12467;&#12540;&#12489;&#12398;&#29305;&#23450;&#12398;&#37096;&#20998;&#12395;&#23550;&#12377;&#12427;&#12496;&#12464;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;</p><pre class="programlisting">

    &lt;!-- &#12377;&#12409;&#12390;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#12354;&#12427; Messages &#12463;&#12521;&#12473;&#12395;&#23550;&#12377;&#12427; unused fields &#35686;&#21578;&#12395;&#19968;&#33268;&#12290; --&gt;
    &lt;Match&gt; 
      &lt;Class name="~.*\.Messages" /&gt;
      &lt;Bug code="UUF" /&gt;
    &lt;/Match&gt;
    &lt;!-- &#12377;&#12409;&#12390;&#12398; internal &#12497;&#12483;&#12465;&#12540;&#12472;&#20869;&#12398; mutable statics &#35686;&#21578;&#12395;&#19968;&#33268;&#12290; --&gt;
    &lt;Match&gt;
      &lt;Package name="~.*\.internal" /&gt;
      &lt;Bug code="MS" /&gt;
    &lt;/Match&gt;
    &lt;!-- ui &#12497;&#12483;&#12465;&#12540;&#12472;&#38542;&#23652;&#20869;&#12398; anonymoous inner classes &#35686;&#21578;&#12395;&#19968;&#33268;&#12290; --&gt;
    &lt;Match&gt;
      &lt;Package name="~com\.foobar\.fooproject\.ui.*" /&gt;
      &lt;Bug pattern="SIC_INNER_SHOULD_BE_STATIC_ANON" /&gt;
    &lt;/Match&gt;

</pre><p>
</p><p>10. &#29305;&#23450;&#12398;&#12471;&#12464;&#12491;&#12481;&#12515;&#12540;&#12434;&#25345;&#12388;&#12501;&#12451;&#12540;&#12523;&#12489;&#12414;&#12383;&#12399;&#12513;&#12477;&#12483;&#12489;&#12398;&#12496;&#12464;&#12395;&#19968;&#33268;&#12373;&#12379;&#12414;&#12377;&#12290;</p><pre class="programlisting">

	&lt;!-- &#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12398; main(String[]) &#12513;&#12477;&#12483;&#12489;&#12395;&#23550;&#12377;&#12427; System.exit(...) usage &#35686;&#21578;&#12395;&#19968;&#33268;&#12290; --&gt;
	&lt;Match&gt;
	  &lt;Method returns="void" name="main" params="java.lang.String[]" /&gt;
	  &lt;Method pattern="DM_EXIT" /&gt;
	&lt;/Match&gt;
	&lt;!-- &#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12398; com.foobar.DebugInfo &#22411;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#23550;&#12377;&#12427; UuF &#35686;&#21578;&#12395;&#19968;&#33268;&#12290; --&gt;
	&lt;Match&gt;
	  &lt;Field type="com.foobar.DebugInfo" /&gt;
	  &lt;Bug code="UuF" /&gt;
	&lt;/Match&gt;

</pre><p>	

</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e2065"></a>6. &#23436;&#20840;&#12394;&#20363;</h2></div></div></div><pre class="programlisting">

&lt;FindBugsFilter&gt;
     &lt;Match&gt;
       &lt;Class name="com.foobar.ClassNotToBeAnalyzed" /&gt;
     &lt;/Match&gt;

     &lt;Match&gt;
       &lt;Class name="com.foobar.ClassWithSomeBugsMatched" /&gt;
       &lt;Bug code="DE,UrF,SIC" /&gt;
     &lt;/Match&gt;

     &lt;!-- XYZ &#36949;&#21453;&#12395;&#19968;&#33268;&#12290;--&gt;
     &lt;Match&gt;
       &lt;Bug code="XYZ" /&gt;
     &lt;/Match&gt;

     &lt;!-- "AnotherClass" &#12398;&#29305;&#23450;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398; doublecheck &#36949;&#21453;&#12395;&#19968;&#33268;&#12290;--&gt;
     &lt;Match&gt;
       &lt;Class name="com.foobar.AnotherClass" /&gt;
       &lt;Or&gt;
         &lt;Method name="nonOverloadedMethod" /&gt;
         &lt;Method name="frob" params="int,java.lang.String" returns="void" /&gt;
         &lt;Method name="blat" params="" returns="boolean" /&gt;
       &lt;/Or&gt;
       &lt;Bug code="DC" /&gt;
     &lt;/Match&gt;

     &lt;!-- dead local store (&#20778;&#20808;&#24230; (&#20013;)) &#12395;&#38306;&#12377;&#12427;&#35492;&#26908;&#20986;&#12364;&#12354;&#12427;&#12513;&#12477;&#12483;&#12489;&#12290;--&gt;
     &lt;Match&gt;
       &lt;Class name="com.foobar.MyClass" /&gt;
       &lt;Method name="someMethod" /&gt;
       &lt;Bug pattern="DLS_DEAD_LOCAL_STORE" /&gt;
       &lt;Priority value="2" /&gt;
     &lt;/Match&gt;
&lt;/FindBugsFilter&gt;

</pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="eclipse.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="analysisprops.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;7&#31456; <span class="application">FindBugs</span>&#8482; Eclipse &#12503;&#12521;&#12464;&#12452;&#12531;&#12398;&#20351;&#29992;&#26041;&#27861;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;9&#31456; &#20998;&#26512;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;</td></tr></table></div></body></html>