<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;5&#31456; FindBugs GUI &#12398;&#20351;&#29992;&#26041;&#27861;</title><meta name="generator" content="DocBook XSL Stylesheets V1.71.1"><link rel="start" href="index.html" title="FindBugs&#8482; &#12510;&#12491;&#12517;&#12450;&#12523;"><link rel="up" href="index.html" title="FindBugs&#8482; &#12510;&#12491;&#12517;&#12450;&#12523;"><link rel="prev" href="running.html" title="&#31532;4&#31456; FindBugs&#8482; &#12398;&#23455;&#34892;"><link rel="next" href="anttask.html" title="&#31532;6&#31456; FindBugs&#8482; Ant &#12479;&#12473;&#12463;&#12398;&#20351;&#29992;&#26041;&#27861;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;5&#31456; <span class="application">FindBugs</span> GUI &#12398;&#20351;&#29992;&#26041;&#27861;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="running.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="anttask.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="gui"></a>&#31532;5&#31456; <span class="application">FindBugs</span> GUI &#12398;&#20351;&#29992;&#26041;&#27861;</h2></div></div></div><div class="toc"><p><b>&#30446;&#27425;</b></p><dl><dt><span class="sect1"><a href="gui.html#d0e1058">1. &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20316;&#25104;</a></span></dt><dt><span class="sect1"><a href="gui.html#d0e1099">2. &#20998;&#26512;&#12398;&#23455;&#34892;</a></span></dt><dt><span class="sect1"><a href="gui.html#d0e1104">3. &#32080;&#26524;&#12398;&#38322;&#35239;</a></span></dt><dt><span class="sect1"><a href="gui.html#d0e1119">4. &#20445;&#23384;&#12392;&#35501;&#12415;&#36796;&#12415;</a></span></dt></dl></div><p>&#12371;&#12398;&#31456;&#12391;&#12399;&#12289;<span class="application">FindBugs</span> &#12464;&#12521;&#12501;&#12451;&#12459;&#12523;&#12518;&#12540;&#12470;&#12540;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473; (GUI) &#12398;&#20351;&#29992;&#26041;&#27861;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;</p><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1058"></a>1. &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#20316;&#25104;</h2></div></div></div><p><span><strong class="command">findbugs</strong></span>  &#12467;&#12510;&#12531;&#12489;&#12391; <span class="application">FindBugs</span> &#12434;&#36215;&#21205;&#12375;&#12390;&#12363;&#12425;&#12289;&#12513;&#12491;&#12517;&#12540;&#12391; <span class="guimenu">File</span> &#8594; <span class="guimenuitem">New Project</span> &#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12381;&#12358;&#12377;&#12427;&#12392;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12480;&#12452;&#12450;&#12525;&#12464;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;:</p><div class="mediaobject"><img src="project-dialog.png"></div><p>
</p><p>&#12300;Class archives and directories to analyze&#12301;&#12486;&#12461;&#12473;&#12488;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#27178;&#12395;&#12354;&#12427; &#12300;Add&#12301;&#12508;&#12479;&#12531;&#12434;&#25276;&#12377;&#12392;&#12289;&#12496;&#12464;&#12434;&#20998;&#26512;&#12377;&#12427; java &#12463;&#12521;&#12473;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427; Java &#12450;&#12540;&#12459;&#12452;&#12502;&#12501;&#12449;&#12452;&#12523; (zip, jar, ear, or war file) &#12434;&#36984;&#25246;&#12375;&#12390;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398; &#12450;&#12540;&#12459;&#12452;&#12502;/&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;</p><p>&#12414;&#12383;&#12289;&#20998;&#26512;&#12434;&#34892;&#12358; Java &#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#21547;&#12435;&#12384;&#12477;&#12540;&#12473;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12358;&#12377;&#12427;&#12392;&#12289;&#12496;&#12464;&#12398;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#22580;&#25152;&#12364;&#12289;<span class="application">FindBugs</span> &#19978;&#12391;&#12495;&#12452;&#12521;&#12452;&#12488;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12477;&#12540;&#12473;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12399;&#12289;Java &#12497;&#12483;&#12465;&#12540;&#12472;&#38542;&#23652;&#12398;&#12523;&#12540;&#12488;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#12518;&#12540;&#12470;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364; <code class="varname">org.foobar.myapp</code> &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#20013;&#12395;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289; <code class="filename">org</code> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12398;&#35242;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434;&#12477;&#12540;&#12473;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12522;&#12473;&#12488;&#12395;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p><p>&#12418;&#12358;&#12402;&#12392;&#12388;&#12289;&#20219;&#24847;&#25351;&#23450;&#12398;&#25163;&#38918;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12428;&#12399;&#12289;&#35036;&#21161;&#29992;&#12398; Jar &#12501;&#12449;&#12452;&#12523;&#12362;&#12424;&#12403;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12434; &#12300;Auxiliary classpath locations&#12301;&#12398;&#12456;&#12531;&#12488;&#12522;&#12540;&#12395;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#20998;&#26512;&#12377;&#12427;&#12450;&#12540;&#12459;&#12452;&#12502;/&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12395;&#12418;&#27161;&#28310;&#12398;&#23455;&#34892;&#26178;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#12418;&#21547;&#12414;&#12428;&#12390;&#12356;&#12394;&#12356;&#12463;&#12521;&#12473;&#12434;&#12289;&#20998;&#26512;&#12377;&#12427;&#12450;&#12540;&#12459;&#12452;&#12502;/&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12364;&#21442;&#29031;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#38917;&#30446;&#12434;&#35373;&#23450;&#12375;&#12383;&#26041;&#12364;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12463;&#12521;&#12473;&#38542;&#23652;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#20351;&#29992;&#12377;&#12427;&#12496;&#12464;&#12487;&#12451;&#12486;&#12463;&#12479;&#12364;&#12289; <span class="application">FindBugs</span> &#12395;&#12399;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;<span class="application">FindBugs</span> &#12364;&#20998;&#26512;&#12434;&#34892;&#12358;&#12463;&#12521;&#12473;&#12398;&#23436;&#20840;&#12394;&#12463;&#12521;&#12473;&#38542;&#23652;&#12434;&#21442;&#29031;&#12391;&#12365;&#12428;&#12400;&#12289;&#12424;&#12426;&#27491;&#30906;&#12394;&#20998;&#26512;&#32080;&#26524;&#12434;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1099"></a>2. &#20998;&#26512;&#12398;&#23455;&#34892;</h2></div></div></div><p>&#12450;&#12540;&#12459;&#12452;&#12502;&#12289;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12362;&#12424;&#12403;&#12477;&#12540;&#12473;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12540;&#12398;&#25351;&#23450;&#12364;&#12391;&#12365;&#12428;&#12400;&#12289;&#12300;Finish&#12301;&#12508;&#12479;&#12531;&#12434;&#25276;&#12375;&#12390; Jar &#12501;&#12449;&#12452;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#12463;&#12521;&#12473;&#12395;&#23550;&#12377;&#12427;&#20998;&#26512;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#24040;&#22823;&#12394;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12434;&#21476;&#12356;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#19978;&#12391;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;&#12363;&#12394;&#12426;&#12398;&#26178;&#38291;(&#25968;&#21313;&#20998;)&#12364;&#12363;&#12363;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#22823;&#23481;&#37327;&#12513;&#12514;&#12522;&#12391;&#12354;&#12427;&#26368;&#36817;&#12398;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12394;&#12425;&#12289;&#22823;&#12365;&#12394;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#12354;&#12387;&#12390;&#12418;&#25968;&#20998;&#31243;&#24230;&#12391;&#20998;&#26512;&#12391;&#12365;&#12414;&#12377;&#12290;</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1104"></a>3. &#32080;&#26524;&#12398;&#38322;&#35239;</h2></div></div></div><p>&#20998;&#26512;&#12364;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#30011;&#38754;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377; :</p><div class="mediaobject"><img src="example-details.png"></div><p>
</p><p>&#24038;&#19978;&#12398;&#12506;&#12452;&#12531;&#12395;&#12399;&#12496;&#12464;&#38542;&#23652;&#12484;&#12522;&#12540;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#20998;&#26512;&#12391;&#12415;&#12388;&#12363;&#12387;&#12383;&#12496;&#12464;&#12398;&#26908;&#32034;&#32080;&#26524;&#12364;&#38542;&#23652;&#30340;&#12395;&#34920;&#31034;&#12373;&#12428;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;</p><p>&#19978;&#37096;&#12398;&#12506;&#12452;&#12531;&#12391;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#19979;&#37096;&#12398;&#12300;Details&#12301;&#12506;&#12452;&#12531;&#12395;&#12496;&#12464;&#12398;&#35443;&#32048;&#35500;&#26126;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#26356;&#12395;&#12289;&#12477;&#12540;&#12473;&#12364;&#12415;&#12388;&#12363;&#12428;&#12400;&#12289;&#21491;&#19978;&#12398;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12506;&#12452;&#12531;&#12395;&#12496;&#12464;&#12398;&#20986;&#29694;&#31623;&#25152;&#12395;&#35442;&#24403;&#12377;&#12427;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#19978;&#22259;&#12398;&#20363;&#12391;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12464;&#12399;&#12289;&#12473;&#12488;&#12522;&#12540;&#12512;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12356;&#12358;&#12418;&#12398;&#12391;&#12377;&#12290;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12539;&#12454;&#12451;&#12531;&#12489;&#12454;&#12395;&#12362;&#12356;&#12390;&#24403;&#35442;&#12473;&#12488;&#12522;&#12540;&#12512;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#29983;&#25104;&#12375;&#12390;&#12356;&#12427;&#34892;&#12364;&#12495;&#12452;&#12521;&#12452;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p><p>&#12496;&#12464;&#12398;&#26908;&#32034;&#32080;&#26524;&#12395;&#23550;&#12375;&#12390;&#12486;&#12461;&#12473;&#12488;&#12391;&#27880;&#37320;&#12434;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#38542;&#23652;&#12484;&#12522;&#12540;&#22259;&#12398;&#12377;&#12368;&#19979;&#12395;&#12354;&#12427;&#12486;&#12461;&#12473;&#12488;&#12508;&#12483;&#12463;&#12473;&#12395;&#27880;&#37320;&#12434;&#20837;&#21147;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#35352;&#37682;&#12375;&#12390;&#12362;&#12365;&#12383;&#12356;&#24773;&#22577;&#12434;&#20309;&#12391;&#12418;&#33258;&#30001;&#12395;&#20837;&#21147;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12496;&#12464;&#32080;&#26524;&#12501;&#12449;&#12452;&#12523;&#12398;&#20445;&#23384;&#12362;&#12424;&#12403;&#35501;&#12415;&#36796;&#12415;&#12434;&#34892;&#12387;&#12383;&#12392;&#12365;&#12395;&#12289;&#27880;&#37320;&#12418;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e1119"></a>4. &#20445;&#23384;&#12392;&#35501;&#12415;&#36796;&#12415;</h2></div></div></div><p>&#12513;&#12491;&#12517;&#12540;&#38917;&#30446;&#12363;&#12425; <span class="guimenu">File</span> &#8594; <span class="guimenuitem">Save as...</span> &#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#20316;&#26989;&#32080;&#26524;&#12434;&#20445;&#23384;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12300;Save as...&#12301;&#12480;&#12452;&#12450;&#12525;&#12464;&#12395;&#12354;&#12427;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12398;&#20013;&#12363;&#12425;&#12300;FindBugs analysis results (.xml)&#12301;&#12434;&#36984;&#25246;&#12371;&#12392;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#25351;&#23450;&#12375;&#12383; jar &#12501;&#12449;&#12452;&#12523;&#12522;&#12473;&#12488;&#12420;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12394;&#12393;&#12398;&#20316;&#26989;&#32080;&#26524;&#12434;&#20445;&#23384;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;jar &#12501;&#12449;&#12452;&#12523;&#12522;&#12473;&#12488;&#12398;&#12415;&#12434;&#20445;&#23384;&#12377;&#12427;&#36984;&#25246;&#32930; (&#12300;FindBugs project file (.fbp)&#12301;) &#12420;&#12496;&#12464;&#26908;&#32034;&#32080;&#26524;&#12398;&#12415;&#12434;&#20445;&#23384;&#12377;&#12427;&#36984;&#25246;&#32930; (&#12300;FindBugs analysis file (.fba)&#12301;) &#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#20445;&#23384;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12513;&#12491;&#12517;&#12540;&#38917;&#30446;&#12363;&#12425; <span class="guimenu">File</span> &#8594; <span class="guimenuitem">Open...</span> &#12434;&#36984;&#25246;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#35501;&#12415;&#36796;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="running.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="anttask.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;4&#31456; <span class="application">FindBugs</span>&#8482; &#12398;&#23455;&#34892;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;6&#31456; <span class="application">FindBugs</span>&#8482; <span class="application">Ant</span> &#12479;&#12473;&#12463;&#12398;&#20351;&#29992;&#26041;&#27861;</td></tr></table></div></body></html>